class AppText {
  static const String landingSgroup = 'تیمی برای ۳۶۰ درجه';
  static const String landingTools = 'ابزاری برای ۳۶۰ درجه';
  static const String landingService = 'سرویسی برای ۳۶۰ درجه';

  static const String departman1 = "دپارتمان طراحی";
  static const String departman2 = "دپارتمان شماره ۲";
  static const String departman3 = "دپارتمان شماره ۳";
  static const String locationOnMap = "نمایش موقعیت روی نقشه";

  static const String knowMore = "بیشتر بدانید";
  static const String getadvise = "دریافت مشاوره";
  static const String aboutUsT = "ارتباط با ما";
  static const String button = "دکمه";
  static const String complement = "تعریف";
  static const String reason = "دلیل اهمیت ";
  static const String keywords = "اصطلاحات کلیدی";
  static const String upload = "آپلود رزومه";
  static const String sendReq = "ارسال درخواست";
  static const String send = "ارسال ";
  static const String serviceTitle = "خدمات ۳۶۰ ";
  static const String serviceSubTitle = "پلتفرم‌های موسیقی و ویدیویی ";
  static const String serviceSubTitle1 = " بازاریابی محتوا ";
  static const String serviceSubTitle2 = " برندینگ ";
  static const String sampleTex = "متن نمونه";
  static const String requierd = "پیش‌نیازها";
  static const String phone = "تلفن ثابت";
  static const String website = "وب‌سایت";
  static const String address = "آدرس";
  static const String email = "ایمیل";
  static const String linkdin = "لینکدین";
  static const String insta = "اینستاگرام";
  static const String telegram = "تلگرام";
  static const String eita = "ایتا";
  static const String front = "توسعه‌دهند Front-end";
  static const String frontdesc =
      "به یک توسعه‌دهنده فرانت‌اند حرفه‌ای و با تجربه برای همکاری در پروژه‌های جذاب و چالش‌برانگیز نیازمندیم.";
  static const String showServices = "مشاهده سرویس‌ها";
  static const String comingSoon = "به زودی...!";
  static const String jobOffers =
      '''آیا آماده‌ای با خلاقیت و اشتیاقت، مسیری نو بسازی؟
اینجا، شما فرصتی دارید تا از مرزها عبور کنید، چیزهای جدید بیاموزید و بر آینده تأثیر بگذارید. اگر به دنبال تجربه‌ای معنادار، رشد فردی و فضایی پرانرژی هستید، همین حالا به ما بپیوندید!''';
  static const String jobOfferTitle = "فرصت‌های شغلی";
  static const String gDesigner = "طراحی گرافیک";
  static const String jobOffersdesc =
      '''در تیم ما، رشد و یادگیری نه یک گزینه، بلکه بخشی از مسیر شماست. اینجا جایی است که با همکاری نزدیک با افراد حرفه‌ای در حوزه‌های مختلف، می‌توانید استعدادهای خود را شکوفا کنید و با ایده‌ها و دیدگاه‌های نوآورانه خود، تاثیر مثبتی بر آینده بگذارید. به ارزش‌های شما احترام می‌گذاریم و محیطی فراهم کرده‌ایم که هم تعادل زندگی و کار و هم شادی و رضایت شما در اولویت باشد.
اگر مشتاقید تا در فضایی حمایتگر، با انرژی و با همدلی کار کنید و فرصت‌های پیش‌رو را به فرصت‌های بزرگ‌تر برای خود و دیگران تبدیل کنید، ما منتظر شما هستیم. بیایید با هم، آینده را بسازیم!''';
  static const String frontPish = '''تسلط کامل به HTML، CSS و JavaScript
آشنایی با فریم‌ورک‌ها و کتابخانه‌ها: مانند React، Vue.js یا Angular
آشنایی با CSS Preprocessors: مانند SASS یا LESS
تجربه کار با ابزارهای مدیریت نسخه: مانند Git
آشنایی با Build Tools: مانند Webpack، Gulp یا Parcel
توانایی کار با RESTful API
تسلط بر طراحی واکنش‌گرا (Responsive Design)
آشنایی با Cross-browser Compatibility: حل ناسازگاری مرورگرها
تجربه کار با ابزارهای طراحی UI/UX: مانند Figma، Sketch یا Adobe XD
توانایی ایجاد انیمیشن و تعاملات کاربر
مهارت حل مسئله و رفع خطاهای فرانت‌اند
مهارت‌های نرم: کار تیمی، مدیریت زمان و ارتباطات
آشنایی با Progressive Web Apps (PWA) (مزیت محسوب می‌شود)
دارای تجربه کاری مرتبط
علاقه‌مند به یادگیری و به‌روز بودن با تکنولوژی‌های جدید''';

  static const String aboutUs =
      '''گروه ۳۶۰ درجه یک مجموعه نوآور است که با هدف فراهم آوردن راه‌حل‌های هوشمند و یکپارچه برای کسب‌وکارها، از دو بخش اصلی سرویس و ابزار تشکیل شده است. در بخش سرویس، ما به کسب‌وکارها کمک می‌کنیم تا با بهره‌گیری از استراتژی‌های پیشرفته و راهکارهای علمی، در بازار رقابتی خود به موفقیت دست یابند.

در بخش ابزار، پلتفرم ما تمامی نیازهای مدیریتی و توسعه‌ای شما را در قالب یک داشبورد یکپارچه فراهم می‌کند. این پلتفرم به شما این امکان را می‌دهد تا تمامی جنبه‌های کسب‌وکار خود را تحت کنترل داشته باشید، از داده‌ها گرفته تا ابزارهای تخصصی برای تصمیم‌گیری‌های بهینه و سریع‌تر.

تیم فنی و متخصصان ما همواره در حال ارتقاء این سیستم هستند و با اضافه کردن ویژگی‌های جدید، تلاش می‌کنند تا تجربه‌ای کامل و بی‌دغدغه برای شما ایجاد کنند. هدف ما این است که شما با آسودگی و تمرکز بر روی پیشرفت و موفقیت خود، از ابزارهای حرفه‌ای و کارآمد ما بهره‌برداری کنید.

در گروه ۳۶۰ درجه، تمامی آنچه برای رشد و موفقیت کسب‌وکار خود نیاز دارید، در دستان شماست.
''';

  static const String lorem =
      ''' لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.''';
  static const String addressSrb = ''' دانشگاه آزاد اسلامی واحد علوم وتحقیقات
کتابخانه دکتر حبیبی
طبقه اول - بلوک C - پلاک ۸۲''';
}

List<String> serviceTitle = [
  "آموزش و توجیه پرسنل",
  AppText.serviceSubTitle1,
  'برندینگ',
  'تبلیغات',
  'تحقیقات بازار',
  'ترویج فروش',
  'جذب و نگاهداشت سرمایه‌های فکری',
  'روابط عمومی',
  'طراحی وب سایت',
  // 'گیمیفیکیشن',
  'برگزاری رویدادهای تخصصی و تعاملی'
];

List<String> serviceDesc = [
  'آموزش مستمر کارکنان به جهت حفظ و بهبود استانداردهای عملکردی و انطباق با شرایط متغیر بازار بسیار مهم است. تربیت نیروی کار آگاه به کسب‌و‌کار این امکان را می‌دهد تا از طریق افزایش کارایی و نوآوری به اهداف استراتژیک خود دست پیدا کند.',
  'بازاریابی محتوا بر ایجاد و توزیع محتوای ارزشمند و مرتبط جهت جذب و حفظ مخاطبان تمرکز دارد. بازاریابی محتوا یک راه موثر برای ایجاد آگاهی و تعامل با کسب و کار از طریق به کارگیری کانال‌های مختلف به حساب می‌آید.',
  'فرآیندی است که طی آن هویتی منحصربفرد برای کسب و کار در ذهن مشتری شکل می‌کیرد. هدف از برندینگ، ایجاد حضوری متمایز و برجسته در بازار است تا مشتریان وفادار، جذب و حفظ شوند.',
  'این فرآیند، شامل معرفی محصولات یا خدمات کسب و کار در کانال‌های مختلف از جمله، تبلیغات تلویزیونی، رادیویی، چاپی، آنلاین و تبلیغات در فضای باز است. تبلیغات موثر با مخاطبان هدف ارتباط برقرار می‌کند و آنها را به استفاده از محصولات یا خدمات ترغیب کرده و سهم بازار و درآمد را افزایش می‌دهد.',
  'تحقیقات بازار برای درک نیازهای مصرف کننده، روندهای بازار و پویایی رقابت اهمیت بالایی دارد و شامل جمع آوری، تجزیه و تحلیل، و تفسیر داده‌ها در مورد بازار، جهت تصمیم‌گیری‌های تجاری مانند توسعه محصول و استراتژی های بازاریابی می‌شود.',
  'ترویج فروش، شامل ایجاد سازوکارهایی است که مشتریان را برای استفاده از محصولات یا خدمات ترغیب می‌کند.',
  'سرمایه‌های فکری، یکی از منابع کلیدی در اقتصاد دانش‌بنیان هستند. جذب و حفظ افراد با استعداد، ایده‌های نوآورانه و تخصص لازم جهت رشد را در اختیار کسب‌و‌کارها قرار می‌دهد',
  'روابط عمومی شامل مدیریت انتشار اطلاعات بین کسب و کار و بازار می‌شود و هدف آن ایجاد و حفظ تصویر مثبت از کسب و کار و ایجاد ارتباط قوی با مخاطبان است.',
  'طراحی وب سایت، بر نحوه درک مخاطب از برند شما تاثیر می‌گذارد. یک وب سایت خوب می‌تواند بازدیدکنندگان بیشتری جذب کرده و آنها را تشویق کند تا با محتوای تولید کسب و کار تعامل داشته باشند.',
  // 'گیمیفیکیشن شامل به کارگیری عناصر و اصول بازی‌سازی جهت افزایش تعامل کاربران، بهبود بهره‌وری سازمانی، یادگیری و ارزیابی کارکنان می‌شود.',
  'با تکیه بر تجربه و دانش تیم ما، رویدادهای شما به فرصتی برای ایجاد ارتباطات ارزشمند، معرفی مؤثر برند و انتقال پیام‌های کلیدی تبدیل می‌شوند. از انتخاب مکان مناسب و برنامه‌ریزی محتوای جذاب گرفته تا مدیریت حرفه‌ای اجرا و هماهنگی‌های پس از رویداد، ما تمامی مراحل را با نگاهی ۳۶۰ درجه پوشش می‌دهیم. با این سرویس، فضایی خلاقانه و به‌یادماندنی بسازید که مخاطبانتان را به تعامل، یادگیری و ایجاد فرصت‌های جدید ترغیب کند.'
];

List<String> serviceComplement = [
  'آموزش و توجیه پرسنل به فرآیند توسعه دانش، مهارت‌ها و نگرش‌های کارکنان در جهت بهبود عملکرد و افزایش بهره‌وری سازمان اشاره دارد. این فرآیند شامل برنامه‌های آموزشی، کارگاه‌ها و دوره‌های توجیهی است که به کارکنان کمک می‌کند تا با اهداف سازمان، ابزارهای کاری، رویه‌ها و استانداردهای کاری آشنا شوند و توانایی‌های خود را ارتقا دهند. آموزش و توجیه پرسنل نه تنها برای کارکنان جدید، بلکه برای تمام اعضای سازمان به‌منظور بهبود مستمر ضروری است.',
  'آیا تا به حال فکر کرده‌اید که چطور می‌توانید با تولید محتوای جذاب، مخاطبان خود را به سمت برندتان جذب کنید؟ بازاریابی محتوا دقیقاً به همین منظور ایجاد شده است. این استراتژی با تولید محتوای ارزشمند و هدفمند، باعث می‌شود که نه تنها ترافیک ارگانیک سایتتان افزایش یابد، بلکه مخاطبان به شما اعتماد کنند و با شما درگیر شوند. محتواهای آموزشی، ویدئوهای جذاب و مقالات خواندنی، ابزاری قدرتمند برای تعامل با مشتریان شما هستند.',
  'برندینگ به فرآیند ایجاد یک تصویر منحصربه‌فرد و متمایز از یک شرکت، محصول یا خدمت در ذهن مخاطبان گفته می‌شود. این فرآیند شامل طراحی و تعریف ارزش‌ها، پیام‌ها، و تجربه‌های منحصر به فرد است که یک برند را از رقبا متمایز می‌کند. هدف برندینگ ایجاد یک هویت پایدار و قابل اعتماد است که نه تنها مخاطبان را جذب کند، بلکه باعث وفاداری و تکرار تعاملات آن‌ها با برند شود.',
  'تبلیغات به معنای اطلاع‌رسانی و ترویج یک محصول، خدمت یا ایده به‌منظور جذب توجه مخاطبان و تشویق آن‌ها به اقدام خاصی است. این فرآیند می‌تواند شامل روش‌های مختلفی مانند تبلیغات چاپی، دیجیتال، تلویزیونی یا محیطی باشد. هدف از تبلیغات ایجاد شناخت، ایجاد تمایل به خرید و در نهایت افزایش فروش است. در دنیای مدرن، تبلیغات علاوه بر ابزارهای سنتی، از فناوری‌های دیجیتال نظیر موتورهای جستجو، شبکه‌های اجتماعی و تبلیغات ویدئویی بهره می‌برد.',
  'تحقیقات بازار فرآیندی سیستماتیک برای جمع‌آوری، تحلیل و تفسیر اطلاعات درباره بازار هدف، مشتریان، رقبا و محیط کسب‌وکار است. هدف اصلی این فرآیند، کمک به سازمان‌ها برای درک نیازها و خواسته‌های مشتریان، شناسایی فرصت‌ها و تهدیدها و بهبود استراتژی‌های بازاریابی است. تحقیقات بازار به کسب‌وکارها این امکان را می‌دهد که تصمیم‌گیری‌های دقیق‌تری داشته باشند و محصولات و خدمات خود را به بهترین شکل ممکن در بازار عرضه کنند.',
  'ترویج فروش به مجموعه‌ای از تکنیک‌ها و فعالیت‌های بازاریابی گفته می‌شود که هدف آن‌ها تحریک تقاضا و افزایش فروش در بازه زمانی کوتاه‌مدت است. این روش‌ها شامل تخفیف‌ها، کوپن‌های خرید، هدایا، مسابقات و بسته‌های ویژه‌ای است که به مشتریان انگیزه می‌دهند تا در زمان کوتاه‌تری اقدام به خرید کنند. ترویج فروش به کسب‌وکارها کمک می‌کند تا نه‌تنها فروش خود را افزایش دهند، بلکه ارتباط قوی‌تری با مشتریان برقرار کنند. به‌عنوان مثال، ارائه تخفیف‌های محدود زمانی یا ارائه کوپن‌ها، باعث می‌شود مشتری‌ها تمایل بیشتری برای خرید سریع‌تر داشته باشند.',
  'سرمایه فکری به مجموعه‌ای از دانش، مهارت‌ها، خلاقیت‌ها و تجربیاتی اشاره دارد که کارکنان به سازمان یا کسب‌وکار اضافه می‌کنند. این سرمایه شامل تخصص‌های منحصر به فرد و ایده‌های نوآورانه‌ای است که به رشد، توسعه و نوآوری در سازمان کمک می‌کند. هدف از جذب و نگهداشت سرمایه‌های فکری، به‌دست آوردن بهترین افراد و حفظ آن‌ها برای دستیابی به موفقیت بلندمدت و پایدار در سازمان است.',
  'روابط عمومی به مجموعه‌ای از فعالیت‌های ارتباطی گفته می‌شود که به‌منظور مدیریت تصویر و ارتباطات یک سازمان با مخاطبانش انجام می‌شود. این فرآیند شامل اطلاع‌رسانی، تعامل با مخاطبان و حفظ و بهبود تصویر مثبت از برند یا سازمان در ذهن عموم مردم و رسانه‌ها است. روابط عمومی می‌تواند در زمینه‌های مختلفی همچون انتشار اخبار، مدیریت رویدادها، رسیدگی به بحران‌ها و ارتباط با رسانه‌ها فعالیت کند. هدف اصلی آن ایجاد اعتماد، افزایش آگاهی و تقویت اعتبار سازمان است.',
  'طراحی وب‌سایت به فرآیند ایجاد یک پلتفرم آنلاین اطلاق می‌شود که به بهترین شکل ممکن نمایانگر برند، محصول یا خدمات باشد و توانایی جذب کاربران را داشته باشد. این فرآیند شامل طراحی بصری، تجربه کاربری (UX)، ساختار سایت، و بهینه‌سازی برای موتورهای جستجو (SEO) است. یک وب‌سایت ایده‌آل نه تنها باید از لحاظ بصری جذاب باشد، بلکه باید کاربرپسند، بهینه‌سازی شده برای دستگاه‌های مختلف و قابل استفاده در تمام پلتفرم‌ها از جمله موبایل، تبلت و دسکتاپ باشد.',
  // 'گیمیفیکیشن (Gamification) به معنای استفاده از عناصر و مکانیزم‌های بازی در محیط‌های غیر بازی است. این مفهوم به‌کارگیری ابزارهای مرتبط با بازی نظیر امتیازدهی، رقابت و پاداش در حوزه‌هایی مانند کسب‌وکار، آموزش و بازاریابی است. هدف اصلی گیمیفیکیشن، افزایش انگیزه و مشارکت افراد در فعالیت‌های مختلف از طریق ایجاد تجربه‌ای مشابه با بازی است. در نتیجه، فعالیت‌هایی که ممکن است در حالت عادی خسته‌کننده به نظر برسند، به فعالیت‌هایی جذاب و چالش‌برانگیز تبدیل می‌شوند.',
  'با تکیه بر تجربه و دانش تیم ما، رویدادهای شما به فرصتی برای ایجاد ارتباطات ارزشمند، معرفی مؤثر برند و انتقال پیام‌های کلیدی تبدیل می‌شوند. از انتخاب مکان مناسب و برنامه‌ریزی محتوای جذاب گرفته تا مدیریت حرفه‌ای اجرا و هماهنگی‌های پس از رویداد، ما تمامی مراحل را با نگاهی ۳۶۰ درجه پوشش می‌دهیم. با این سرویس، فضایی خلاقانه و به‌یادماندنی بسازید که مخاطبانتان را به تعامل، یادگیری و ایجاد فرصت‌های جدید ترغیب کند.',
];

List<String> serviceImportance = [
  'آموزش و توجیه پرسنل از جنبه‌های مختلفی برای سازمان‌ها اهمیت دارد. از یک سو، به بهبود عملکرد و بهره‌وری کارکنان کمک می‌کند و از سوی دیگر، باعث افزایش رضایت و انگیزه آن‌ها می‌شود. کارکنانی که به خوبی آموزش دیده‌اند، درک بهتری از نقش خود در سازمان دارند و می‌توانند با کارآیی بالاتری به اهداف سازمانی دست یابند.',
  'بازاریابی محتوا نقش اساسی در ایجاد ارتباط عمیق‌تر با مخاطبان دارد. در دنیای دیجیتال امروز، کاربران به دنبال محتوایی هستند که نه تنها اطلاعات مفیدی ارائه دهد، بلکه نیازها و مشکلاتشان را نیز درک کند. با ارائه محتوای ارزشمند، کسب‌وکارها می‌توانند خود را به عنوان متخصصان در زمینه کاری خود معرفی کنند و اعتماد مخاطبان را جلب کنند. علاوه بر این، بازاریابی محتوا باعث بهبود رتبه سایت در موتورهای جستجو می‌شود و ترافیک ارگانیک را افزایش می‌دهد، که این امر منجر به افزایش فرصت‌های تبدیل بازدیدکنندگان به مشتریان می‌شود.',
  'برندینگ نقش کلیدی در ایجاد تمایز و افزایش ارزش کسب‌وکار دارد. در بازاری که رقابت شدید است، یک برند قوی می‌تواند به شما کمک کند تا از رقبا پیشی بگیرید. برندینگ مؤثر اعتماد و وفاداری مشتریان را جلب می‌کند، زیرا مشتریان تمایل دارند با برندهایی تعامل داشته باشند که ارزش‌ها و پیام‌های آن‌ها را درک می‌کنند و با آن‌ها همسو هستند. علاوه بر این، یک برند قوی می‌تواند تأثیر مستقیمی بر تصمیم‌گیری خرید مشتریان داشته باشد و ارزش طول عمر مشتری را افزایش دهد. در نهایت، برندینگ موفق به ایجاد ارتباطات عاطفی با مخاطبان منجر می‌شود که این امر نه تنها فروش را افزایش می‌دهد، بلکه باعث ایجاد طرفداران وفادار برای برند می‌شود.',
  'تبلیغات بخش جدایی‌ناپذیر از استراتژی بازاریابی هر کسب‌وکاری است. تبلیغات مؤثر به شناخته‌شدن برند، جذب مشتریان جدید و افزایش فروش منجر می‌شود. در دنیای پررقابت امروز، تبلیغات به یکی از مهم‌ترین ابزارها برای برجسته‌کردن محصولات و خدمات تبدیل شده است.',
  'تحقیقات بازار به کسب‌وکارها کمک می‌کند تا نیازهای مشتریان خود را بهتر بشناسند، بازارهای جدید را کشف کنند و به‌طور مؤثرتری با رقبا رقابت کنند. اطلاعات حاصل از تحقیقات بازار، به بهبود استراتژی‌های بازاریابی، تولید محصولات بهتر و توسعه خدمات متناسب با نیازهای بازار کمک می‌کند.',
  'ترویج فروش از اهمیت ویژه‌ای در بازارهای رقابتی برخوردار است، زیرا یکی از مؤثرترین روش‌ها برای تحریک تقاضا و افزایش خرید در کوتاه‌مدت محسوب می‌شود. تحقیقات نشان می‌دهد که حدود 75 درصد از مشتریان تمایل دارند از تخفیف‌ها و کوپن‌ها استفاده کنند، و این امر نشان‌دهنده قدرت بالای ترویج فروش در جذب مخاطبان است. علاوه بر این، متخصصان بازاریابی بر این باورند که ترویج فروش نه تنها به جذب مشتریان جدید کمک می‌کند، بلکه می‌تواند مشتریان فعلی را نیز تشویق به خرید بیشتر نماید. در بازه‌های زمانی خاص مانند تعطیلات یا مناسبت‌های ویژه، ترویج فروش به کسب‌وکارها این امکان را می‌دهد که به اهداف فروش خود دست یابند و سهم بیشتری از بازار را به دست آورند',
  'جذب و نگهداشت سرمایه‌های فکری اهمیت بسیار زیادی برای موفقیت و نوآوری سازمان‌ها دارد. کارکنان با مهارت و تجربه، منابع اصلی توسعه محصولات نوآورانه و خدمات رقابتی در بازار هستند. همچنین، نگهداشت این افراد برای سازمان اهمیت دارد، زیرا از دست دادن آن‌ها می‌تواند به کاهش بهره‌وری و آسیب به رشد سازمان منجر شود. ',
  'روابط عمومی نقش محوری در ساخت و نگهداشت تصویر مثبت از یک برند یا سازمان دارد. تصویر عمومی مثبت نه تنها اعتماد مخاطبان را جلب می‌کند، بلکه باعث تقویت جایگاه سازمان در بازار و جامعه نیز می‌شود. روابط عمومی می‌تواند از طریق مدیریت مؤثر ارتباطات و واکنش مناسب در زمان بحران، اعتبار سازمان را حفظ کند. ',
  'یک وب‌سایت بهینه و با طراحی مناسب، اولین تأثیر مثبت را بر ذهن کاربران ایجاد می‌کند. طراحی مناسب نه تنها باعث جذب کاربران به وب‌سایت می‌شود، بلکه آنها را ترغیب می‌کند که زمان بیشتری در سایت بمانند، خدمات یا محصولات را بررسی کنند و احتمالاً خرید انجام دهند. ',
  // 'گیمیفیکیشن تنها یک ابزار سرگرمی نیست، بلکه یک راهبرد اثربخش برای افزایش تعامل و انگیزه در میان کارکنان، دانش‌آموزان و مشتریان است. به‌کارگیری گیمیفیکیشن به‌خصوص در محیط‌های کسب‌وکار و آموزش، نشان داده است که می‌تواند بهره‌وری و انگیزه افراد را به طرز چشمگیری افزایش دهد.',
  '''برگزاری رویدادهای تخصصی و تعاملی اهمیت زیادی دارد، زیرا:
1. افزایش آگاهی از برند و اعتمادسازی:
   وقتی در یک رویداد تخصصی شرکت می‌کنید یا آن را برگزار می‌کنید، مخاطبان بیشتر با برند و مأموریت شما آشنا می‌شوند. تجربه مستقیم و تعامل رو در رو باعث ایجاد اعتماد و درک بهتر ارزش‌های شما می‌شود.
2. ایجاد ارتباطات و شبکه‌سازی مؤثر:
   در چنین رویدادهایی، متخصصان، کسب‌وکارها و علاقه‌مندان یک حوزه خاص گرد هم می‌آیند. این محیط فرصتی عالی برای شبکه‌سازی، تبادل ایده‌ها و ایجاد روابط حرفه‌ای است که می‌تواند در آینده به همکاری‌ها و فرصت‌های جدید تبدیل شود.
3. افزایش مشارکت و تعامل مخاطبان:
   رویدادهای تعاملی نسبت به رویدادهای یک‌طرفه اثربخشی بالاتری دارند. هنگامی‌که مخاطب صرفاً شنونده نیست و در گفت‌وگوها، کارگاه‌ها و فعالیت‌ها مشارکت می‌کند، ارتباط عمیق‌تری با محتوای ارائه‌شده برقرار می‌شود و رضایت و انگیزه مخاطب افزایش می‌یابد.
4. تقویت جایگاه تخصصی و اعتبار حرفه‌ای:
   میزبانی رویدادی که محتوای علمی، تخصصی و کاربردی ارائه می‌دهد، نشان‌دهنده توانایی و درک بالای شما از بازار و صنعت است. این امر نه‌تنها برند را در جایگاه یک مرجع معتبر تثبیت می‌کند، بلکه تصویر ذهنی مثبتی از شما در ذهن مخاطبان ایجاد می‌کند.
5. ارائه ارزش به مخاطب و مشتریان:
   برگزاری رویدادهای تخصصی به مخاطب اجازه می‌دهد تا نه‌تنها به دانش جدیدی دست پیدا کند، بلکه با محصولات، خدمات و راهکارهای جدید آشنا شود. به این ترتیب، مخاطب احساس می‌کند در این رویداد چیزی فراتر از یک جلسه معمولی به دست آورده است.
به طور خلاصه، برگزاری رویدادهای تخصصی و تعاملی ابزاری قدرتمند برای ارتقای برند، ایجاد اعتماد، توسعه شبکه‌های حرفه‌ای و افزایش مشارکت مخاطبان است که در نهایت به رشد و موفقیت کسب‌وکار می‌انجامد.
'''
];

Map<String, Map> jobOfferMap = {
  "front End": {
    "title": AppText.front,
    'desc': AppText.frontdesc,
    "reqLIst": [
      'تسلط کامل به HTML، CSS و JavaScript',
      'آشنایی با فریم‌ورک‌ها و کتابخانه‌ها: مانند React، Vue.js یا Angular',
      'آشنایی با CSS Preprocessors: مانند SASS یا LESS',
      'تجربه کار با ابزارهای مدیریت نسخه: مانند Git',
      'آشنایی با Build Tools: مانند Gulp، Webpack یا Parcel',
      'تسلط بر طراحی واکنش‌گرا (Responsive Design)',
      'آشنایی با Cross-browser Compatibility: حل ناسازگاری مرورگرها',
      'تجربه کار با ابزارهای طراحی UI/UX: مانند Figma، Sketch یا Adobe XD',
      'توانایی ایجاد انیمیشن و تعاملات کاربر',
      'مهارت‌های نرم: کار تیمی، مدیریت زمان و ارتباطات',
      'آشنایی با Progressive Web Apps (PWA)',
      'دارای تجربه کاری مرتبط علاقه‌مند به یادگیری و به‌روز بودن با تکنولوژی‌های جدید',
    ],
  },
};

Map<int, List<String>> keyWords = {
  0: [
    '''توسعه کارکنان (Employee Development)
مجموعه‌ای از فعالیت‌ها که به ارتقای مهارت‌ها، دانش و توانایی‌های کارکنان برای دستیابی به اهداف سازمان کمک می‌کند.''',
    '''آموزش شغلی (On-the-Job Training)
فرآیند آموزش کارکنان در محیط واقعی کار، با هدف تقویت مهارت‌های عملی و بهبود عملکرد.''',
    '''برنامه‌های توجیهی (Orientation Programs)
برنامه‌هایی که برای آشنا کردن کارکنان جدید با فرهنگ سازمان، رویه‌ها و استانداردهای کاری طراحی می‌شوند.''',
  ],
  1: [
    '''مخاطب هدف (Target Audience):
گروه خاصی از افراد که محتوای شما برای آن‌ها طراحی و تولید می‌شود، با درک نیازها، علاقه‌ها و مشکلات آن‌ها.''',
    '''سئو (SEO - Search Engine Optimization):
مجموعه‌ای از تکنیک‌ها و استراتژی‌ها که به بهبود رتبه وب‌سایت شما در نتایج موتورهای جستجو کمک می‌کند تا محتوای شما برای مخاطبان بیشتر قابل دسترسی باشد.''',
    '''کال تو اکشن (Call to Action):
عبارت یا دکمه‌ای که کاربران را تشویق به انجام اقدام مشخصی می‌کند، مانند ثبت‌نام، دانلود یا خرید.''',
    '''تقویم محتوا (Content Calendar):
برنامه‌ریزی زمان‌بندی شده برای تولید و انتشار محتوا که به سازماندهی و هماهنگی تلاش‌های بازاریابی محتوا کمک می‌کند.''',
  ],
  2: [
    '''هویت برند
مجموعه‌ای از ویژگی‌ها و ارزش‌ها که شخصیت برند را شکل می‌دهند، شامل نام، لوگو، رنگ‌ها و صدای برند.''',
    '''ارزش پیشنهادی
دلیل اصلی که چرا مشتریان باید برند شما را انتخاب کنند؛ این ارزش‌ها باید به‌طور واضح به مزایای منحصربه‌فرد شما اشاره کنند.''',
    '''وفاداری برند
تعهدی که مشتریان به یک برند پیدا می‌کنند و آن را در طول زمان تکراراً انتخاب می‌کنند.''',
  ],
  3: [
    '''هدف‌گذاری (Targeting)
انتخاب گروه خاصی از افراد که بیشترین احتمال را دارند تا به تبلیغات پاسخ دهند.''',
    '''تبلیغات دیجیتال
نوعی از تبلیغات که از پلتفرم‌های آنلاین مانند وب‌سایت‌ها، شبکه‌های اجتماعی و اپلیکیشن‌ها استفاده می‌کند.''',
    '''پیام تبلیغاتی:
محتوا یا متنی که به‌منظور جذب مخاطبان به‌صورت خلاقانه طراحی شده است.''',
  ],
  4: [
    '''بازار هدف (Target Market)
گروه خاصی از مشتریان که کسب‌وکار قصد دارد محصولات یا خدمات خود را به آن‌ها ارائه دهد.''',
    '''تحقیقات اولیه (Primary Research):
جمع‌آوری اطلاعات از منابع دست اول مانند نظرسنجی‌ها، مصاحبه‌ها و گروه‌های متمرکز.''',
    '''تحقیقات ثانویه (Secondary Research):
استفاده از اطلاعات و داده‌های موجود که قبلاً توسط دیگران جمع‌آوری شده است، مانند گزارش‌های صنعت و مقالات پژوهشی.''',
  ],
  5: [
    '''کوپن تخفیف: 
به نوعی از کد یا برگه اطلاق می‌شود که مشتریان با استفاده از آن می‌توانند در خرید کالا یا خدمات از تخفیف ویژه‌ای بهره‌مند شوند. این کوپن‌ها معمولاً شامل یک درصد یا مبلغ مشخصی تخفیف هستند و ممکن است به‌صورت فیزیکی یا دیجیتال ارائه شوند. به‌عنوان مثال، وارد کردن یک کد تخفیف در هنگام خرید اینترنتی باعث کاهش قیمت نهایی محصول می‌شود.''',
    '''فروش با هدیه: 
این روش شامل ارائه یک محصول یا خدمت اضافی به همراه خرید اصلی است. به این معنا که مشتری پس از خرید یک محصول، یک هدیه رایگان نیز دریافت می‌کند. این هدیه می‌تواند یک محصول مکمل یا مرتبط با خرید اصلی باشد که باعث افزایش ارزش خرید برای مشتری می‌شود.''',
    '''مسابقات و قرعه‌کشی‌ها: 
یکی از روش‌های جذاب برای تشویق مشتریان به خرید بیشتر، برگزاری مسابقات و قرعه‌کشی‌هاست. مشتریان با شرکت در این رویدادها شانس دریافت جوایز متنوعی را پیدا می‌کنند. این رویدادها اغلب به‌عنوان یک مشوق اضافی در کنار خرید اصلی طراحی می‌شوند و هدف آن‌ها افزایش تعامل مشتریان با برند و ترویج فروش است''',
  ],
  6: [
    '''جذب استعداد (Talent Acquisition):
فرآیند شناسایی و جذب افراد با مهارت‌های برجسته و توانایی‌های مناسب که می‌توانند به رشد و توسعه سازمان کمک کنند.''',
    '''نگهداشت استعداد (Talent Retention):
استراتژی‌هایی برای حفظ کارکنان کلیدی و با ارزش و جلوگیری از ترک آن‌ها.''',
    '''سرمایه انسانی:
مجموعه‌ای از توانمندی‌ها، دانش و تجربیات کارکنان که به عنوان منبع اصلی ایجاد ارزش برای سازمان عمل می‌کنند.''',
  ],
  7: [
    '''رسانه‌های جمعی (Mass Media):
استفاده از رسانه‌های گسترده‌ای مانند تلویزیون، روزنامه‌ها و وب‌سایت‌ها به‌منظور رساندن پیام سازمان به مخاطبان گسترده.''',
    '''مدیریت بحران (Crisis Management):
واکنش سریع و مؤثر به موقعیت‌های بحرانی که می‌تواند بر تصویر عمومی سازمان تأثیر منفی بگذارد.''',
    '''بیانیه مطبوعاتی (Press Release):
اطلاعیه رسمی که به‌منظور اعلام رویدادها یا اخبار مهم سازمان به رسانه‌ها ارسال می‌شود.''',
  ],
  8: [
    '''تجربه کاربری (UX):
میزان تعامل کاربر با وب‌سایت و میزان سهولت استفاده از بخش‌های مختلف آن.''',
    '''طراحی واکنش‌گرا (Responsive):
طراحی که به‌صورت خودکار با اندازه و نوع دستگاه‌های مختلف هماهنگ می‌شود.''',
    '''بهینه‌سازی برای موتورهای جستجو (SEO):
مجموعه‌ای از اقدامات که باعث می‌شود وب‌سایت در نتایج موتورهای جستجو نظیر گوگل بهتر دیده شود.''',
  ],
//   9: [
//     '''امتیازدهی:
// در این سیستم، افراد با انجام وظایف یا دستیابی به اهداف مشخص، امتیاز کسب می‌کنند.''',
//     '''نشان‌ها (Badges):
// پس از رسیدن به اهداف یا موفقیت‌های خاص، افراد نشان‌هایی به عنوان دستاورد دریافت می‌کنند.''',
//     '''چالش‌ها و رقابت‌ها:
// کاربران با موانع و رقابت‌هایی مواجه می‌شوند که نیازمند عبور از آن‌ها برای اثبات توانمندی و برتری خود هستند.''',
//   ],
  9: [
    '''برندینگ رویداد (Event Branding):
   ایجاد هویت بصری و مفهومی منحصربه‌فرد برای رویداد تا در ذهن مخاطب ماندگار شود.''',
    '''تعامل مخاطب (Audience Engagement):
   افزایش سطح مشارکت و تعامل حضار با محتوای رویداد، از جمله پرسش‌وپاسخ، نظرسنجی‌های زنده یا بازی‌های تعاملی.''',
    '''تجربه کاربری رویداد (Event User Experience - UX):
   طراحی و بهینه‌سازی تمامی نقاط تماس حضار با رویداد برای ایجاد تجربه‌ای روان، جذاب و به‌یادماندنی.''',
    '''برنامه‌ریزی محتوایی (Content Planning):
   تعریف استراتژی و ساختار محتوای رویداد، انتخاب سخنرانان، موضوعات کارگاه‌ها و فعالیت‌های جانبی.''',
    '''مدیریت لجستیک (Logistics Management):
   هماهنگی تمامی مسائل فنی و اجرایی مانند مکان، تجهیزات صوتی‌تصویری، پذیرایی، حمل‌ونقل و زمان‌بندی.''',
    '''پوشش چندرسانه‌ای (Multimedia Coverage):
   بهره‌برداری از ویدئو، عکس، پخش زنده و شبکه‌های اجتماعی برای افزایش دسترسی و ماندگاری محتوای رویداد.''',
    '''حلیل و ارزیابی رویداد (Event Analytics & Evaluation):
   جمع‌آوری و تحلیل داده‌ها از حضور، نظرسنجی‌های پس‌ازرویداد، تحلیل رفتار مخاطب و بازخوردها برای بهبود رویدادهای آینده.''',
    '''رویدادهای ترکیبی (Hybrid Events):
   ترکیب رویداد حضوری با پخش آنلاین برای دسترسی به مخاطبان گسترده‌تر و ایجاد انعطاف در شرکت‌کنندگان.''',
    '''هدف‌گذاری رویداد (Event Objectives):
   تعریف اهداف روشن مانند افزایش آگاهی از برند، شبکه‌سازی، فروش محصول یا انتقال دانش تخصصی، که موفقیت رویداد بر اساس آن سنجیده می‌شود.''',
    '''ROI رویداد (Event Return on Investment):
    ارزیابی سودمندی رویداد نسبت به هزینه‌های صرف‌شده، از جمله رشد فروش، تقویت ارتباطات، افزایش آگاهی و هر شاخص کلیدی عملکرد (KPI) دیگر.''',
  ],
};
